---
kind: method
id: M:Autodesk.Revit.DB.TemporaryGraphicsManager.GetTemporaryGraphicsManager(Autodesk.Revit.DB.Document)
source: html/208ba2b1-7658-c4eb-6a66-1d6a90878ccf.htm
---
# Autodesk.Revit.DB.TemporaryGraphicsManager.GetTemporaryGraphicsManager Method

Gets a TemporaryGraphicsManager reference of the document.

## Syntax (C#)
```csharp
public static TemporaryGraphicsManager GetTemporaryGraphicsManager(
	Document document
)
```

## Parameters
- **document** (`Autodesk.Revit.DB.Document`) - The document.

## Returns
Instance of TemporaryGraphicsManager.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null